analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32680/Include/gcr_regs.h
/**@} end of group GCR_ECCERR_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECCCED GCR_ECCCED
 * @brief    ECC Not Double Error Detect Register
 * @{
 */
#define MXC_F_GCR_ECCCED_RAM_POS                       0 /**< ECCCED_RAM Position */
#define MXC_F_GCR_ECCCED_RAM                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_RAM_POS)) /**< ECCCED_RAM Mask */

/**@} end of group GCR_ECCCED_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECCIE GCR_ECCIE
 * @brief    ECC IRQ Enable Register
 * @{
 */
#define MXC_F_GCR_ECCIE_RAM_POS                        0 /**< ECCIE_RAM Position */
#define MXC_F_GCR_ECCIE_RAM                            ((uint32_t)(0x1UL << MXC_F_GCR_ECCIE_RAM_POS)) /**< ECCIE_RAM Mask */

/**@} end of group GCR_ECCIE_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECCADDR GCR_ECCADDR
 * @brief    ECC Error Address Register
 * @{
 */
#define MXC_F_GCR_ECCADDR_ECCERRAD_POS                 0 /**< ECCADDR_ECCERRAD Position */
#define MXC_F_GCR_ECCADDR_ECCERRAD                     ((uint32_t)(0xFFFFFFFFUL << MXC_F_GCR_ECCADDR_ECCERRAD_POS)) /**< ECCADDR_ECCERRAD Mask */

/**@} end of group GCR_ECCADDR_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_BTLELDOCTRL GCR_BTLELDOCTRL
 * @brief    BTLE LDO Control Register
 * @{
 */
#define MXC_F_GCR_BTLELDOCTRL_LDOBBEN_POS              0 /**< BTLELDOCTRL_LDOBBEN Position */
#define MXC_F_GCR_BTLELDOCTRL_LDOBBEN                  ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDOBBEN_POS)) /**< BTLELDOCTRL_LDOBBEN Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDOBBPULLD_POS           1 /**< BTLELDOCTRL_LDOBBPULLD Position */
#define MXC_F_GCR_BTLELDOCTRL_LDOBBPULLD               ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDOBBPULLD_POS)) /**< BTLELDOCTRL_LDOBBPULLD Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDOBBVSEL_POS            2 /**< BTLELDOCTRL_LDOBBVSEL Position */
#define MXC_F_GCR_BTLELDOCTRL_LDOBBVSEL                ((uint32_t)(0x3UL << MXC_F_GCR_BTLELDOCTRL_LDOBBVSEL_POS)) /**< BTLELDOCTRL_LDOBBVSEL Mask */
#define MXC_V_GCR_BTLELDOCTRL_LDOBBVSEL_0_85           ((uint32_t)0x0UL) /**< BTLELDOCTRL_LDOBBVSEL_0_85 Value */
#define MXC_S_GCR_BTLELDOCTRL_LDOBBVSEL_0_85           (MXC_V_GCR_BTLELDOCTRL_LDOBBVSEL_0_85 << MXC_F_GCR_BTLELDOCTRL_LDOBBVSEL_POS) /**< BTLELDOCTRL_LDOBBVSEL_0_85 Setting */
#define MXC_V_GCR_BTLELDOCTRL_LDOBBVSEL_0_9            ((uint32_t)0x1UL) /**< BTLELDOCTRL_LDOBBVSEL_0_9 Value */
#define MXC_S_GCR_BTLELDOCTRL_LDOBBVSEL_0_9            (MXC_V_GCR_BTLELDOCTRL_LDOBBVSEL_0_9 << MXC_F_GCR_BTLELDOCTRL_LDOBBVSEL_POS) /**< BTLELDOCTRL_LDOBBVSEL_0_9 Setting */
#define MXC_V_GCR_BTLELDOCTRL_LDOBBVSEL_1_0            ((uint32_t)0x2UL) /**< BTLELDOCTRL_LDOBBVSEL_1_0 Value */
#define MXC_S_GCR_BTLELDOCTRL_LDOBBVSEL_1_0            (MXC_V_GCR_BTLELDOCTRL_LDOBBVSEL_1_0 << MXC_F_GCR_BTLELDOCTRL_LDOBBVSEL_POS) /**< BTLELDOCTRL_LDOBBVSEL_1_0 Setting */
#define MXC_V_GCR_BTLELDOCTRL_LDOBBVSEL_1_1            ((uint32_t)0x3UL) /**< BTLELDOCTRL_LDOBBVSEL_1_1 Value */
#define MXC_S_GCR_BTLELDOCTRL_LDOBBVSEL_1_1            (MXC_V_GCR_BTLELDOCTRL_LDOBBVSEL_1_1 << MXC_F_GCR_BTLELDOCTRL_LDOBBVSEL_POS) /**< BTLELDOCTRL_LDOBBVSEL_1_1 Setting */

#define MXC_F_GCR_BTLELDOCTRL_LDORFEN_POS              4 /**< BTLELDOCTRL_LDORFEN Position */
#define MXC_F_GCR_BTLELDOCTRL_LDORFEN                  ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDORFEN_POS)) /**< BTLELDOCTRL_LDORFEN Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDORFPULLD_POS           5 /**< BTLELDOCTRL_LDORFPULLD Position */
#define MXC_F_GCR_BTLELDOCTRL_LDORFPULLD               ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDORFPULLD_POS)) /**< BTLELDOCTRL_LDORFPULLD Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDORFVSEL_POS            6 /**< BTLELDOCTRL_LDORFVSEL Position */
#define MXC_F_GCR_BTLELDOCTRL_LDORFVSEL                ((uint32_t)(0x3UL << MXC_F_GCR_BTLELDOCTRL_LDORFVSEL_POS)) /**< BTLELDOCTRL_LDORFVSEL Mask */
#define MXC_V_GCR_BTLELDOCTRL_LDORFVSEL_0_85           ((uint32_t)0x0UL) /**< BTLELDOCTRL_LDORFVSEL_0_85 Value */
#define MXC_S_GCR_BTLELDOCTRL_LDORFVSEL_0_85           (MXC_V_GCR_BTLELDOCTRL_LDORFVSEL_0_85 << MXC_F_GCR_BTLELDOCTRL_LDORFVSEL_POS) /**< BTLELDOCTRL_LDORFVSEL_0_85 Setting */
#define MXC_V_GCR_BTLELDOCTRL_LDORFVSEL_0_9            ((uint32_t)0x1UL) /**< BTLELDOCTRL_LDORFVSEL_0_9 Value */
#define MXC_S_GCR_BTLELDOCTRL_LDORFVSEL_0_9            (MXC_V_GCR_BTLELDOCTRL_LDORFVSEL_0_9 << MXC_F_GCR_BTLELDOCTRL_LDORFVSEL_POS) /**< BTLELDOCTRL_LDORFVSEL_0_9 Setting */
#define MXC_V_GCR_BTLELDOCTRL_LDORFVSEL_1_0            ((uint32_t)0x2UL) /**< BTLELDOCTRL_LDORFVSEL_1_0 Value */
#define MXC_S_GCR_BTLELDOCTRL_LDORFVSEL_1_0            (MXC_V_GCR_BTLELDOCTRL_LDORFVSEL_1_0 << MXC_F_GCR_BTLELDOCTRL_LDORFVSEL_POS) /**< BTLELDOCTRL_LDORFVSEL_1_0 Setting */
#define MXC_V_GCR_BTLELDOCTRL_LDORFVSEL_1_1            ((uint32_t)0x3UL) /**< BTLELDOCTRL_LDORFVSEL_1_1 Value */
#define MXC_S_GCR_BTLELDOCTRL_LDORFVSEL_1_1            (MXC_V_GCR_BTLELDOCTRL_LDORFVSEL_1_1 << MXC_F_GCR_BTLELDOCTRL_LDORFVSEL_POS) /**< BTLELDOCTRL_LDORFVSEL_1_1 Setting */

#define MXC_F_GCR_BTLELDOCTRL_LDORFBYP_POS             8 /**< BTLELDOCTRL_LDORFBYP Position */
#define MXC_F_GCR_BTLELDOCTRL_LDORFBYP                 ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDORFBYP_POS)) /**< BTLELDOCTRL_LDORFBYP Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDORFDISCH_POS           9 /**< BTLELDOCTRL_LDORFDISCH Position */
#define MXC_F_GCR_BTLELDOCTRL_LDORFDISCH               ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDORFDISCH_POS)) /**< BTLELDOCTRL_LDORFDISCH Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDOBBBYP_POS             10 /**< BTLELDOCTRL_LDOBBBYP Position */
#define MXC_F_GCR_BTLELDOCTRL_LDOBBBYP                 ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDOBBBYP_POS)) /**< BTLELDOCTRL_LDOBBBYP Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDOBBDISCH_POS           11 /**< BTLELDOCTRL_LDOBBDISCH Position */
#define MXC_F_GCR_BTLELDOCTRL_LDOBBDISCH               ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDOBBDISCH_POS)) /**< BTLELDOCTRL_LDOBBDISCH Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDOBBENDLY_POS           12 /**< BTLELDOCTRL_LDOBBENDLY Position */
#define MXC_F_GCR_BTLELDOCTRL_LDOBBENDLY               ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDOBBENDLY_POS)) /**< BTLELDOCTRL_LDOBBENDLY Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDORFENDLY_POS           13 /**< BTLELDOCTRL_LDORFENDLY Position */
#define MXC_F_GCR_BTLELDOCTRL_LDORFENDLY               ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDORFENDLY_POS)) /**< BTLELDOCTRL_LDORFENDLY Mask */

