analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32680/Include/gcr_regs.h
#define MXC_F_GCR_BTLELDOCTRL_LDORFBYPENENDLY_POS      14 /**< BTLELDOCTRL_LDORFBYPENENDLY Position */
#define MXC_F_GCR_BTLELDOCTRL_LDORFBYPENENDLY          ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDORFBYPENENDLY_POS)) /**< BTLELDOCTRL_LDORFBYPENENDLY Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDOBBBYPENENDLY_POS      15 /**< BTLELDOCTRL_LDOBBBYPENENDLY Position */
#define MXC_F_GCR_BTLELDOCTRL_LDOBBBYPENENDLY          ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDOBBBYPENENDLY_POS)) /**< BTLELDOCTRL_LDOBBBYPENENDLY Mask */

/**@} end of group GCR_BTLELDOCTRL_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_BTLELDODLY GCR_BTLELDODLY
 * @brief    BTLE LDO Delay Register
 * @{
 */
#define MXC_F_GCR_BTLELDODLY_BYPDLYCNT_POS             0 /**< BTLELDODLY_BYPDLYCNT Position */
#define MXC_F_GCR_BTLELDODLY_BYPDLYCNT                 ((uint32_t)(0xFFUL << MXC_F_GCR_BTLELDODLY_BYPDLYCNT_POS)) /**< BTLELDODLY_BYPDLYCNT Mask */

#define MXC_F_GCR_BTLELDODLY_LDOBBDLYCNT_POS           8 /**< BTLELDODLY_LDOBBDLYCNT Position */
#define MXC_F_GCR_BTLELDODLY_LDOBBDLYCNT               ((uint32_t)(0x1FFUL << MXC_F_GCR_BTLELDODLY_LDOBBDLYCNT_POS)) /**< BTLELDODLY_LDOBBDLYCNT Mask */

#define MXC_F_GCR_BTLELDODLY_LDORFDLYCNT_POS           20 /**< BTLELDODLY_LDORFDLYCNT Position */
#define MXC_F_GCR_BTLELDODLY_LDORFDLYCNT               ((uint32_t)(0x1FFUL << MXC_F_GCR_BTLELDODLY_LDORFDLYCNT_POS)) /**< BTLELDODLY_LDORFDLYCNT Mask */

/**@} end of group GCR_BTLELDODLY_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32680_INCLUDE_GCR_REGS_H_
